Masmiseim36/nxpSDK/middleware/mcu-boot/targets/MIMXRT1015/src/startup/arm/startup_MIMXRT1015.s
; * -------------------------------------------------------------------------
; *  @file:    startup_MIMXRT1015.s
; *  @purpose: CMSIS Cortex-M7 Core Device Startup File
; *            MIMXRT1015
; * -------------------------------------------------------------------------
; *
; * Copyright (c) 1997-2015 Freescale Semiconductor, Inc.
; * Copyright 2016-2018 NXP
; * All rights reserved.
; *
; * SPDX-License-Identifier: BSD-3-Clause
; *
; *------- <<< Use Configuration Wizard in Context Menu >>> ------------------
; *
; *****************************************************************************/


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
                IMPORT  |Image$$ARM_LIB_STACK$$ZI$$Limit|

__Vectors       DCD     |Image$$ARM_LIB_STACK$$ZI$$Limit| ; Top of Stack
                DCD     Reset_Handler  ; Reset Handler
                DCD     NMI_Handler                         ;NMI Handler
                DCD     HardFault_Handler                   ;Hard Fault Handler
                DCD     MemManage_Handler                   ;MPU Fault Handler
                DCD     BusFault_Handler                    ;Bus Fault Handler
                DCD     UsageFault_Handler                  ;Usage Fault Handler
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     0                                   ;Reserved
                DCD     SVC_Handler                         ;SVCall Handler
                DCD     DebugMon_Handler                    ;Debug Monitor Handler
                DCD     0                                   ;Reserved
                DCD     PendSV_Handler                      ;PendSV Handler
                DCD     SysTick_Handler                     ;SysTick Handler

                                                            ;External Interrupts
                DCD     DMA0_DMA16_IRQHandler               ;DMA channel 0/16 transfer complete
                DCD     DMA1_DMA17_IRQHandler               ;DMA channel 1/17 transfer complete
                DCD     DMA2_DMA18_IRQHandler               ;DMA channel 2/18 transfer complete
                DCD     DMA3_DMA19_IRQHandler               ;DMA channel 3/19 transfer complete
                DCD     DMA4_DMA20_IRQHandler               ;DMA channel 4/20 transfer complete
                DCD     DMA5_DMA21_IRQHandler               ;DMA channel 5/21 transfer complete
                DCD     DMA6_DMA22_IRQHandler               ;DMA channel 6/22 transfer complete
                DCD     DMA7_DMA23_IRQHandler               ;DMA channel 7/23 transfer complete
                DCD     DMA8_DMA24_IRQHandler               ;DMA channel 8/24 transfer complete
                DCD     DMA9_DMA25_IRQHandler               ;DMA channel 9/25 transfer complete
                DCD     DMA10_DMA26_IRQHandler              ;DMA channel 10/26 transfer complete
                DCD     DMA11_DMA27_IRQHandler              ;DMA channel 11/27 transfer complete
                DCD     DMA12_DMA28_IRQHandler              ;DMA channel 12/28 transfer complete
                DCD     DMA13_DMA29_IRQHandler              ;DMA channel 13/29 transfer complete
                DCD     DMA14_DMA30_IRQHandler              ;DMA channel 14/30 transfer complete
                DCD     DMA15_DMA31_IRQHandler              ;DMA channel 15/31 transfer complete
                DCD     DMA_ERROR_IRQHandler                ;DMA error interrupt channels 0-15 / 16-31
                DCD     CTI0_ERROR_IRQHandler               ;CTI trigger outputs
                DCD     CTI1_ERROR_IRQHandler               ;CTI trigger outputs
                DCD     CORE_IRQHandler                     ;CorePlatform exception IRQ
                DCD     LPUART1_IRQHandler                  ;LPUART1 TX interrupt and RX interrupt
                DCD     LPUART2_IRQHandler                  ;LPUART2 TX interrupt and RX interrupt
                DCD     LPUART3_IRQHandler                  ;LPUART3 TX interrupt and RX interrupt
                DCD     LPUART4_IRQHandler                  ;LPUART4 TX interrupt and RX interrupt
                DCD     Reserved40_IRQHandler               ;Reserved interrupt
                DCD     Reserved41_IRQHandler               ;Reserved interrupt
                DCD     Reserved42_IRQHandler               ;Reserved interrupt
                DCD     Reserved43_IRQHandler               ;Reserved interrupt
                DCD     LPI2C1_IRQHandler                   ;LPI2C1 interrupt
                DCD     LPI2C2_IRQHandler                   ;LPI2C2 interrupt
                DCD     Reserved46_IRQHandler               ;Reserved interrupt
                DCD     Reserved47_IRQHandler               ;Reserved interrupt
                DCD     LPSPI1_IRQHandler                   ;LPSPI1 single interrupt vector for all sources
                DCD     LPSPI2_IRQHandler                   ;LPSPI2 single interrupt vector for all sources
                DCD     Reserved50_IRQHandler               ;Reserved interrupt
                DCD     Reserved51_IRQHandler               ;Reserved interrupt
                DCD     Reserved52_IRQHandler               ;Reserved interrupt
                DCD     Reserved53_IRQHandler               ;Reserved interrupt
                DCD     FLEXRAM_IRQHandler                  ;FlexRAM address out of range Or access hit IRQ
                DCD     KPP_IRQHandler                      ;Keypad nterrupt
                DCD     Reserved56_IRQHandler               ;Reserved interrupt
                DCD     GPR_IRQ_IRQHandler                  ;Used to notify cores on exception condition while boot
                DCD     Reserved58_IRQHandler               ;Reserved interrupt
                DCD     Reserved59_IRQHandler               ;Reserved interrupt
                DCD     Reserved60_IRQHandler               ;Reserved interrupt
                DCD     WDOG2_IRQHandler                    ;WDOG2 interrupt
                DCD     SNVS_HP_WRAPPER_IRQHandler          ;SNVS Functional Interrupt
                DCD     SNVS_HP_WRAPPER_TZ_IRQHandler       ;SNVS Security Interrupt
                DCD     SNVS_LP_WRAPPER_IRQHandler          ;ON-OFF button press shorter than 5 secs (pulse event)
                DCD     CSU_IRQHandler                      ;CSU interrupt
                DCD     DCP_IRQHandler                      ;Combined DCP channel interrupts(except channel 0) and CRC interrupt
                DCD     DCP_VMI_IRQHandler                  ;IRQ of DCP channel 0
                DCD     Reserved68_IRQHandler               ;Reserved interrupt
                DCD     TRNG_IRQHandler                     ;TRNG interrupt
                DCD     Reserved70_IRQHandler               ;Reserved interrupt
                DCD     BEE_IRQHandler                      ;BEE interrupt
                DCD     SAI1_IRQHandler                     ;SAI1 interrupt
                DCD     SAI2_IRQHandler                     ;SAI1 interrupt
                DCD     SAI3_RX_IRQHandler                  ;SAI3 interrupt
                DCD     SAI3_TX_IRQHandler                  ;SAI3 interrupt
                DCD     SPDIF_IRQHandler                    ;SPDIF interrupt
                DCD     PMU_IRQHandler                      ;PMU interrupt
                DCD     Reserved78_IRQHandler               ;Reserved interrupt
                DCD     TEMP_LOW_HIGH_IRQHandler            ;TEMPMON interrupt
                DCD     TEMP_PANIC_IRQHandler               ;TEMPMON interrupt
                DCD     USB_PHY_IRQHandler                  ;USBPHY (OTG1 UTMI), Interrupt
                DCD     Reserved82_IRQHandler               ;Reserved interrupt
                DCD     ADC1_IRQHandler                     ;ADC1 interrupt
                DCD     Reserved84_IRQHandler               ;Reserved interrupt
                DCD     DCDC_IRQHandler                     ;DCDC interrupt
                DCD     Reserved86_IRQHandler               ;Reserved interrupt
                DCD     Reserved87_IRQHandler               ;Reserved interrupt
                DCD     GPIO1_INT0_IRQHandler               ;Active HIGH Interrupt from INT0 from GPIO
                DCD     GPIO1_INT1_IRQHandler               ;Active HIGH Interrupt from INT1 from GPIO
                DCD     GPIO1_INT2_IRQHandler               ;Active HIGH Interrupt from INT2 from GPIO
                DCD     GPIO1_INT3_IRQHandler               ;Active HIGH Interrupt from INT3 from GPIO
                DCD     GPIO1_INT4_IRQHandler               ;Active HIGH Interrupt from INT4 from GPIO
                DCD     GPIO1_INT5_IRQHandler               ;Active HIGH Interrupt from INT5 from GPIO
                DCD     GPIO1_INT6_IRQHandler               ;Active HIGH Interrupt from INT6 from GPIO
                DCD     GPIO1_INT7_IRQHandler               ;Active HIGH Interrupt from INT7 from GPIO
                DCD     GPIO1_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO1 signal 0 throughout 15
                DCD     GPIO1_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO1 signal 16 throughout 31
                DCD     GPIO2_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO2 signal 0 throughout 15
                DCD     GPIO2_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO2 signal 16 throughout 31
                DCD     GPIO3_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO3 signal 0 throughout 15
                DCD     GPIO3_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO3 signal 16 throughout 31
                DCD     Reserved102_IRQHandler              ;Reserved interrupt
                DCD     Reserved103_IRQHandler              ;Reserved interrupt
                DCD     GPIO5_Combined_0_15_IRQHandler      ;Combined interrupt indication for GPIO5 signal 0 throughout 15
                DCD     GPIO5_Combined_16_31_IRQHandler     ;Combined interrupt indication for GPIO5 signal 16 throughout 31
                DCD     FLEXIO1_IRQHandler                  ;FLEXIO1 interrupt
                DCD     Reserved107_IRQHandler              ;Reserved interrupt
                DCD     WDOG1_IRQHandler                    ;WDOG1 interrupt
                DCD     RTWDOG_IRQHandler                   ;RTWDOG interrupt
                DCD     EWM_IRQHandler                      ;EWM interrupt
                DCD     CCM_1_IRQHandler                    ;CCM IRQ1 interrupt
                DCD     CCM_2_IRQHandler                    ;CCM IRQ2 interrupt
                DCD     GPC_IRQHandler                      ;GPC interrupt
                DCD     SRC_IRQHandler                      ;SRC interrupt
                DCD     Reserved115_IRQHandler              ;Reserved interrupt
                DCD     GPT1_IRQHandler                     ;GPT1 interrupt
                DCD     GPT2_IRQHandler                     ;GPT2 interrupt
                DCD     PWM1_0_IRQHandler                   ;PWM1 capture 0, compare 0, or reload 0 interrupt
                DCD     PWM1_1_IRQHandler                   ;PWM1 capture 1, compare 1, or reload 0 interrupt
                DCD     PWM1_2_IRQHandler                   ;PWM1 capture 2, compare 2, or reload 0 interrupt
                DCD     PWM1_3_IRQHandler                   ;PWM1 capture 3, compare 3, or reload 0 interrupt
                DCD     PWM1_FAULT_IRQHandler               ;PWM1 fault or reload error interrupt
                DCD     Reserved123_IRQHandler              ;Reserved interrupt
                DCD     FLEXSPI_IRQHandler                  ;FlexSPI0 interrupt
                DCD     Reserved125_IRQHandler              ;Reserved interrupt
                DCD     Reserved126_IRQHandler              ;Reserved interrupt
                DCD     Reserved127_IRQHandler              ;Reserved interrupt
                DCD     Reserved128_IRQHandler              ;Reserved interrupt
                DCD     USB_OTG1_IRQHandler                 ;USBO2 USB OTG1
                DCD     Reserved130_IRQHandler              ;Reserved interrupt
                DCD     Reserved131_IRQHandler              ;Reserved interrupt
                DCD     XBAR1_IRQ_0_1_IRQHandler            ;XBAR1 interrupt
                DCD     XBAR1_IRQ_2_3_IRQHandler            ;XBAR1 interrupt
                DCD     ADC_ETC_IRQ0_IRQHandler             ;ADCETC IRQ0 interrupt
                DCD     ADC_ETC_IRQ1_IRQHandler             ;ADCETC IRQ1 interrupt
                DCD     ADC_ETC_IRQ2_IRQHandler             ;ADCETC IRQ2 interrupt
                DCD     ADC_ETC_ERROR_IRQ_IRQHandler        ;ADCETC Error IRQ interrupt
                DCD     PIT_IRQHandler                      ;PIT interrupt
                DCD     Reserved139_IRQHandler              ;Reserved interrupt
                DCD     Reserved140_IRQHandler              ;Reserved interrupt
                DCD     Reserved141_IRQHandler              ;Reserved interrupt
                DCD     Reserved142_IRQHandler              ;Reserved interrupt
                DCD     Reserved143_IRQHandler              ;Reserved interrupt
                DCD     Reserved144_IRQHandler              ;Reserved interrupt
                DCD     ENC1_IRQHandler                     ;ENC1 interrupt
                DCD     Reserved146_IRQHandler              ;Reserved interrupt
                DCD     Reserved147_IRQHandler              ;Reserved interrupt
                DCD     Reserved148_IRQHandler              ;Reserved interrupt
                DCD     TMR1_IRQHandler                     ;TMR1 interrupt
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

